let duas = `
*اللهم إنك عفو كريم تحب العفو فاعفُ عني*
*اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت*
*اللهم إني أسألك العفو والعافية في الدنيا والآخرة*
*اللهم اجعل لي من كل هم فرجاً، ومن كل ضيق مخرجاً، ومن كل بلاء عافية*
*اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين وقهر الرجال*
*اللهم اجعل القرآن العظيم ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همي*
*اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك*
*اللهم ارزقني حبك، وحب من يحبك، وحب عمل يقربني إلى حبك*
*اللهم إني أسألك حسن الخاتمة، وأعوذ بك من سوء الخاتمة*
*اللهم اغفر لنا ذنوبنا، وكفر عنا سيئاتنا، وتوفنا مع الأبرار*
`;

function handler(m) {
    m.reply(duas);
}

handler.help = ['أدعية'];
handler.tags = ['main', 'fun'];
handler.command = ['دعاء', 'أدعية'];
handler.group = false;

export default handler;