let istighfar = `
*استغفر الله العظيم*
من كل ذنب أذنبتـــــه 
*استغفر الله العظيم*
من كل فرض تركتـــه 
*استغفر الله العظيم*
من كل إنسان ظلمتــه 
*استغفر الله العظيم*
من كل صالح جفوتــه 
*أستغفر الله العظيم*
من كل ظالم صاحبتــه 
*أستغفر الله العظيم*
من كل بر أجلتـــــــــه 
*أستغفر الله العظيم*
من كل ناصح أهنتـــه 
*أستغفر الله العظيم*
من كل محمود سئمتـــه 
*أستغفر الله العظيم*
من كل زور نطقـت بـه 
*أستغفر الله العظيم*
من كل حق اضعتــــه 
*أستغفر الله العظيم*
من كل باطل إتبعتـــه 
*أستغفر الله العظيم*
من كل وقت أهدرتــه 
*أستغفر الله العظيم*
من كل ضمير قتلتـــه 
*أستغفر الله العظيم*
من كل سر أفشيتــــه 
*أستغفر الله العظيم*
من كل أمين خدعتــه 
*أستغفر الله العظيم*
من كل وعد أخلفتـــه 
*أستغفر الله العظيم*
من كل عهد خنتـــــه 
*أستغفر الله العظيم*
من كل امرئ خذلتـه 
*أستغفر الله العظيم*
من كل صواب كتمتــه 
*أستغفر الله العظيم*
من كل خطأ تفوهـت بـه 
*أستغفر الله العظيم*
من كل عرض هتكتــه 
*أستغفر الله العظيم*
من كل ستر فضحتــه 
*أستغفر الله العظيم*
من كل لغو سمعتــه 
*أستغفر الله العظيم*
من كل حرام نظرت إليـه 
*أستغفر الله العظيم*
من كل كلام لهوت بــه 
*أستغفر الله العظيم*
من كل إثـم فعلتـــه 
*أستغفر الله العظيم*
من كل نصح خالفتــه 
*أستغفر الله العظيم*
من كل علم نسيتــه 
*أستغفر الله العظيم*
من كل شك أطعتــه 
*أستغفر الله العظيم*
من كل ظن لازمتــه 
*أستغفر الله العظيم*
من كل ضلال عرفتــه 
*أستغفر الله العظيم*
من كل دين أهملتــه 
*أستغفر الله العظيم* 
من كل معصية عصيت بها ربي
*أستغفر الله العظيم*
من كل ما وعدتك به ثم عدت فيه من نفسي ولم أوف به 
*أستغفر الله العظيم*
من كل عمل أردت به وجهك فخالطني به غيرك 
*أستغفر الله العظيم*
من كل نعمة أنعمت علي بها فاستعنت بها على معصيتك 
*أستغفر الله العظيم*
من كل ذنب أذنبته في ضياء النهار أو سواد الليل في ملأ أو خلا أو سر أو علانية 
*أستغفر الله العظيم*
من كل مال إكتسبته بغير الحق 
*أستغفر الله العظيم*
من كل علم سئلت عنه فكتمته 
*أستغفر الله العظيم*
من كل قول صالح لم أعمل به وخالفتــه 
*أستغفر الله العظيم*
من كل فرض خالفته ومن كل بدعة إتبعتهــا 
*أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه* 
*استغفرك ربي لتقصيريّ وقلة صبري* 
*استغفرك ربي حتى تغفر ليّ وترحم ضعفيّ*
*استغفرك ربي حتى ترضى عني وتدخلني جنتك إنك أنت التوّاب الغفور*
`;

function handler(m) {
    m.reply(istighfar);
}

handler.help = ['استغفار'];
handler.tags = ['main', 'fun'];
handler.command = ['استغفار', 'استغفارات'];
handler.group = false;

export default handler;