let handler = async (m, { conn, command, text }) => {
let love = `
*✥━─━⌬〘🔥〙⌬━─━✥*

⬪  ࣪    ࣭     ࣪     ࣭   𝅦𝅦   ࣭     ࣪     ࣭    ࣪  ⬫
⬪  ࣪    ࣭     ࣪     ࣭   𝅦𝅦   ࣭     ࣪     ࣭    ࣪  ⬫
⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪▭̷໋̟  ۫ 𝑾𝑬𝑳𝑪𝑶𝑴𝑬 ۫  ▭̷໋̟۪۬໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪
   ‏

*✥━─━⌬〘🔥〙⌬━─━✥*

*⌬〘 مرحبا بك في بوت تربو 〙⌬*

*⌬〘 اليك قائمه بسورس البوت 〙⌬*

*✥━─━⌬〘🔥〙⌬━─━✥*

*⌬〘 تم تطويري وبرمجتي 〙⌬*
*⌬〘 بواسطه م مهند التربو 〙⌬*
*⌬〘 هذا البوت يعمل بالخاص 〙⌬*
*⌬〘 ويعمل ايضاا بالمجموعات 〙⌬*
*⌬〘 اذا كنت تريد ابلاغ عن مشكلة 〙⌬*
*⌬〘 اكتب الامر (.ابلاغ) 〙⌬*

*✥━─━⌬〘🔥〙⌬━─━✥*

*⌬〘 مجموعه الدعم 〙⌬*

*⏣⊰ https://chat.whatsapp.com/HTAcYFJ19sC07ykgnKqBzp ⊱⏣*

*⌬〘 رقم مطوري 〙⌬*

*⏣⊰ https://wa.me/+201119857886 ⊱⏣*

*✥━─━⌬〘🔥〙⌬━─━✥*
 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(السورس|الدعم)$/i
export default handler