import pkg from '@whiskeysockets/baileys';
const { generateWAMessageFromContent, proto, prepareWAMessageMedia } = pkg

var handler = async (m, { conn, usedPrefix }) => {
const tips = [
    "هل عمرك حبيت حد في السر وما اعترفتش؟",
    "ايه اكتر موقف محرج حصل لك في المدرسة؟",
    "ايه اغرب حاجة عملتها وانت طفشان؟",
    "هل عمرك بصيت على حد وحسيت انك معجب بيه بس مقدرتش تقوله؟",
    "ايه اسوأ حاجة حصلت لك في حياتك؟",
    "هل عمرك ضحكت على حاجة مش مضحكة عشان متحركش مشاعر حد؟",
    "ايه اكتر حاجة بتخاف منها؟",
    "هل عمرك كذبت كذبة بيضا عشان متزعلش حد؟",
    "ايه اكتر حاجة بتحب تعملها وانت لوحدك؟",
    "ايه اكتر موقف محرج حصل لك وانت في مطعم؟",
    "هل عمرك حبيت حد من طرف واحد؟",
    "ايه اكتر حاجة بتخليك سعيد وانت حزين؟",
    "هل عمرك خدت حاجة من غير ما تقول لحد؟",
    "ايه اكتر حاجة بتحبها في نفسك؟",
    "هل عمرك حسيت انك مش مقبول وسط صحابك؟",
    "ايه اكتر حاجة محرجة حصلت لك قدام حد بتحبه؟",
    "ايه اكتر فيلم بكيت فيه؟",
    "هل عمرك قابلت حد مشهور؟ وحكيتله ايه؟",
    "ايه اكتر حاجة بتحب تعملها وانت زهقان؟",
    "هل عمرك نمت في حصة المدرسة؟",
    "ايه اكتر عادة سيئة عندك؟",
    "هل عمرك اتكلمت في موضوع وانت مش فاهمه؟",
    "ايه اكتر حاجة محرجة حصلت لك في الشغل؟",
    "هل عمرك ضحكت على حد عشان موقفه المحرج؟",
    "ايه اكتر حاجة بتحبها في جسمك؟",
    "هل عمرك فكرت في شخص بطريقة مش لطيفة؟",
    "ايه اكتر موقف محرج حصل لك في حفلة؟",
    "هل عمرك حسيت انك غلطت في حق حد ومقدرتش تعتذر؟",
    "ايه اكتر حاجة بتكرهها في نفسك؟",
    "هل عمرك قلدت حد وتورطت؟",
    "ايه اكتر حاجة مضحكة حصلت لك مع اهلك؟",
    "هل عمرك نمت في مكان غريب؟",
    "ايه اكتر حاجة محرجة حصلت لك في السفر؟",
    "هل عمرك حسيت انك مش محبوب في مجموعة؟",
    "ايه اكتر موقف محرج حصل لك مع دكتور؟",
    "هل عمرك تسببت في مشكلة من غير قصد؟",
    "ايه اكتر حاجة بتخاف منها وانت لوحدك؟",
    "هل عمرك نسيت حاجة مهمة وكنت محروم؟",
    "ايه اكتر حاجة محرجة حصلت لك وانت بتتكلم في التليفون؟",
    "هل عمرك حسيت انك مش مرغوب فيك في مكان معين؟",
    "ايه اكتر حاجة بتضحكك؟",
    "هل عمرك قلدت حد بشكل سيء؟",
    "ايه اكتر حاجة بتكرهها في المواصلات؟",
    "هل عمرك نمت وانت بتذاكر؟",
    "ايه اكتر حاجة محرجة حصلت لك في عيد ميلادك؟",
    "هل عمرك حسيت انك مضطرب نفسيا؟",
    "ايه اكتر حاجة بتحبها في فصل الصيف؟",
    "هل عمرك اتسببت في مشكلة كبيرة؟",
    "ايه اكتر حاجة بتكرهها في نفسك؟",
    "هل عمرك شعرت انك عايز تغير شخصيتك؟",
    "ايه اكتر حاجة محرجة حصلت لك مع مدرس؟",
    "هل عمرك عملت حاجة وانت ندمان عليها؟",
    "ايه اكتر حاجة بتحبها في الشتاء؟",
    "هل عمرك حسيت انك مضطرب اجتماعيا؟",
    "ايه اكتر حاجة محرجة حصلت لك وانت في الباص؟",
    "هل عمرك ضحكت على حاجة مش مضحكة عشان متزعلش حد؟",
    "ايه اكتر حاجة بتخاف منها وانت في الضلمة؟",
    "هل عمرك فكرت انك تهرب من البيت؟",
    "ايه اكتر حاجة محرجة حصلت لك في النادي؟",
    "هل عمرك حسيت انك مش مفيد؟",
    "ايه اكتر حاجة بتحب تعملها وانت مكتئب؟",
    "هل عمرك ندمت على حاجة عملتها؟",
    "ايه اكتر حاجة محرجة حصلت لك في الشارع؟",
    "هل عمرك حسيت انك مش مرغوب فيك في المدرسة؟",
    "ايه اكتر حاجة مضحكة حصلت لك مع اصحابك؟",
    "هل عمرك فكرت انك تغير شغلك؟",
    "ايه اكتر حاجة بتحبها في نفسك؟",
    "هل عمرك حسيت انك مش محبوب في العيلة؟",
    "ايه اكتر حاجة محرجة حصلت لك وانت بتسوق؟",
    "هل عمرك فكرت في شخص بطريقة مش لطيفة؟",
    "ايه اكتر موقف محرج حصل لك في السينما؟",
    "هل عمرك حسيت انك غلطت في حق حد ومقدرتش تعتذر؟",
    "ايه اكتر حاجة بتكرهها في شغلك؟",
    "هل عمرك قلدت حد وتورطت؟",
    "ايه اكتر حاجة مضحكة حصلت لك مع عيلتك؟",
    "هل عمرك نمت في مكان غريب؟",
    "ايه اكتر حاجة محرجة حصلت لك في الاجازة؟",
    "هل عمرك حسيت انك مش مرغوب فيك في مجموعة؟",
    "ايه اكتر موقف محرج حصل لك مع صاحبك؟",
    "هل عمرك تسببت في مشكلة من غير قصد؟",
    "ايه اكتر حاجة بتخاف منها وانت لوحدك؟",
    "هل عمرك نسيت حاجة مهمة وكنت محروم؟",
    "ايه اكتر حاجة محرجة حصلت لك وانت بتتكلم في التليفون؟",
    "هل عمرك حسيت انك مش مرغوب فيك في مكان معين؟",
    "ايه اكتر حاجة بتضحكك؟",
    "هل عمرك قلدت حد بشكل سيء؟",
    "ايه اكتر حاجة بتكرهها في المواصلات؟",
    "هل عمرك نمت وانت بتذاكر؟",
    "ايه اكتر حاجة محرجة حصلت لك في عيد ميلادك؟",
    "هل عمرك حسيت انك مضطرب نفسيا؟",
    "ايه اكتر حاجة بتحبها في فصل الصيف؟",
    "هل عمرك اتسببت في مشكلة كبيرة؟",
    "ايه اكتر حاجة بتكرهها في نفسك؟",
    "هل عمرك شعرت انك عايز تغير شخصيتك؟",
    "ايه اكتر حاجة محرجة حصلت لك مع مدرس؟",
    "هل عمرك عملت حاجة وانت ندمان عليها؟",
    "ايه اكتر حاجة بتحبها في الشتاء؟",
    "هل عمرك حسيت انك مضطرب اجتماعيا؟",
    "ايه اكتر حاجة محرجة حصلت لك وانت في الباص؟"
] 
const randomImage = tips[Math.floor(Math.random() * tips.length)];
   var messa = await prepareWAMessageMedia({ image: { url:'https://telegra.ph/file/086ac84a0dec87b4b1561.jpg' } }, { upload: conn.waUploadToServer });
let msg = generateWAMessageFromContent(m.chat, {
  viewOnceMessage: {
    message: {
        "messageContextInfo": {
          "deviceListMetadata": {},
          "deviceListMetadataVersion": 2
        },
        interactiveMessage: proto.Message.InteractiveMessage.create({
          body: proto.Message.InteractiveMessage.Body.create({
            text: `*${randomImage}*\n*⊱─═⪨༻𓆩⚡𓆪༺⪩═─⊰*`
          }),
          footer: proto.Message.InteractiveMessage.Footer.create({
            text: "⚡𝐓𝐄𝐑𝐁𝐎⚡"
          }),
          header: proto.Message.InteractiveMessage.Header.create({
            title: "*⊱⪨༻𓆩〘سؤال〙𓆪༺⪩⊰*",
            subtitle: "احراج",
            hasMediaAttachment: true, 
            imageMessage: messa.imageMessage, 
          }),
          nativeFlowMessage: proto.Message.InteractiveMessage.NativeFlowMessage.create({
            buttons: [
              {
               name: "quick_reply",
               buttonParamsJson:JSON.stringify({
                 "display_text":"التالي","id":".محرج" 
                })
               }, 
              {
                "name": "quick_reply",
                "buttonParamsJson": "{\"display_text\":\"الدعم\",\"id\":\".الدعم\"}"
               } 
              ],
          })
        })
    }
  }
}, {})

await conn.relayMessage(msg.key.remoteJid, msg.message, { messageId: msg.key.id })

} 
handler.tags = ['frasss'];
handler.command = ['أحرجني','محرج','احرجني','أحراج','احراج'];
export default handler; 